benchmarks/parasiticRipples/N800/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1906                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
  //3.698
  //default         CrankNicolson 1.0;
  default         Euler;
}

gradSchemes
{
  default        Gauss linear;
  //default        edgeCellsLeastSquares;//Gauss linear;
}

divSchemes
{
  //div(rhoPhi,U)  Gauss linearUpwind grad(U);
  div(rhoPhi,U)  Gauss limitedLinearV 1;
  //div(rhoPhi,U)  Gauss linear;
  //div(rhoPhi,U)  Gauss linear;
  //div(phi,C)     Gauss linearUpwind grad(C);
  //div(phi,alpha)  Gauss vanLeer;
   div(phi,alpha)  Gauss vanLeer;
   div(phirb,alpha) Gauss linear;
   //div(phirb,alpha) Gauss vanLeer;
   div(((rho*nuEff)*dev2(T(grad(U))))) Gauss linear;
}

laplacianSchemes
{
  //default         Gauss linear orthogonal;
    default         Gauss linear corrected;
}

interpolationSchemes
{
  default         linear;

  //interpolate(K_) harmonic;
      /*  flux(U) linear;
    interpolate(nHat) linear;
    interpolate(rho) linear;
    interpolate(normal.water) linear;
    interpolate(sigma) linear;
    interpolate((1|A(U))) linear;
    dotInterpolate(S,U_0) linear;
    interpolate((rho*(1|A(U)))) linear;
    flux(HbyA) linear;*/
}

snGradSchemes
{
    default         corrected;
}

fluxRequired
{
    default         no;
    p_rgh;
    pcorr;
    alpha1;
}

// ************************************************************************* //
