benchmarks/parasiticRipples/N800/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1906                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
  /*"alpha.water.*"
    {
        nAlphaCorr      0;
        nAlphaSubCycles 0;
        cAlpha          1.0;

        MULESCorr       no;
        nLimiterIter    8;

        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-12;
        relTol          0;
	}*/

  
   "alpha.water.*"
    {
	advectionScheme isoAdvection; //MULESScheme;
	reconstructionScheme mycCartesian; //youngCartesian; //plicRDF; // isoAlpha; // isoAlpha
	//reconstructionScheme plicRDF; // isoAlpha; // isoAlpha

      isoFaceTol      1e-10;
      surfCellTol     1e-8;
      nAlphaBounds    3;
      snapTol         1e-12;
      clip            true;
      //writeSurfCells  true;
      //writeBoundedCells true;
      writeIsoFaces   false;
      //reconstructionScheme isoAlpha;
      
      nAlphaCorr      1;
      nAlphaSubCycles 1;
      cAlpha          1;
    }

    "pcorr.*"
    {
        solver          PCG;
        //preconditioner  FDIC;
	preconditioner
	  {
	  preconditioner  GAMG;
	  tolerance       1e-03;
	  relTol          0;
	  nVcycles        2;
	  smoother        DICGaussSeidel;
	  nPreSweeps      2;
	  }
        tolerance       1e-9;
        relTol          0;
	}

    p_rgh
    {
        solver          PCG;
        //preconditioner  FDIC;
	preconditioner
        {
	  preconditioner  GAMG;
	  tolerance       1e-03;
	  relTol          0;
	  nVcycles        2;
	  smoother        DICGaussSeidel;
	  nPreSweeps      2;
	  }
        tolerance       1e-08;
        relTol          0.0001;
	minIter         2;
    }

    p_rghFinal
    {
      solver          PCG;
      // preconditioner  FDIC;
      preconditioner
        {
	  preconditioner  GAMG;
	  tolerance       1e-03;
	  relTol          0;
	  nVcycles        2;
	  smoother        DICGaussSeidel;
	  nPreSweeps      2;
	  }
      tolerance       1e-12;
      relTol          0.000000001;
    }

     
    /* p_rgh
    {
      //solver          GAMG;
      //
      solver          PCG;
      preconditioner
        {
	  preconditioner  GAMG;
	  tolerance       1e-03;
	  relTol          0;
	  nVcycles        2;
	  smoother        DICGaussSeidel;
	  nPreSweeps      2;
	}
      tolerance       1e-08;
      relTol          0.001;
      maxIter         200;
      //smoother        DIC;
    }

    p_rghFinal
    {
      solver          PCG;
      preconditioner
        {
	  preconditioner  GAMG;
	  tolerance       1e-06;
	  relTol          0;
	  nVcycles        2;
	  smoother        DICGaussSeidel;
	  nPreSweeps      2;
	}
        tolerance       1e-10;
        relTol          1e-6;
        maxIter         200;
	}*/

    
    U
    {
      solver          PBiCG;
      preconditioner  DILU;    
      smoother        GaussSeidel;
      //tolerance       1e-08;
      // relTol          0.1;
      // solver          smoothSolver;
      //smoother        symGaussSeidel;
      tolerance       1e-12;
      relTol          0.0001;
    }

    UFinal
    {
      solver          PBiCG;
      preconditioner  DILU;    
      smoother        GaussSeidel;
      //tolerance       1e-08;
      // relTol          0.1;
      // solver          smoothSolver;
      //smoother        symGaussSeidel;
      tolerance       1e-8;
      relTol          0.000001;
    }


    /*UFinal
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-10;
        relTol          0.0000000001;
	}*/

}

PIMPLE
{
    momentumPredictor   yes;
    nOuterCorrectors    1;
    nCorrectors         5;
    nNonOrthogonalCorrectors 0;
    correctPhi     no;
    //pRefCell        10;
    //pRefValue       0;
}



// ************************************************************************* //
