benchmarks/parasiticRipples/N800/system/ijkDict
{
cellSet refinedCells;
cyclicX true;
}
