benchmarks/parasiticRipples/N800/system/setAlphaFieldDict_0.04
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      setAlphaFieldDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

field           "alpha1";

type            randomWaveField;

amplitude       1;

waterLevel      0;

interfaceTol    1e-08;

nRows           3;

N               32;

height          0.04;

waveNumber          (6.28319 0 0);

A 
32
(
 0.019875891068072
 0.0012697149059634
 0.00012235631900356
 1.4009237345998e-05
 1.7645336206608e-06
 2.3614756198683e-07
 3.2958417619076e-08
        4.7436891133326e-09
        6.9902072036657e-10
        1.0493857419559e-10
        1.5992354202244e-11
        2.4676955495536e-12
        3.8477270303779e-13
        6.05303993672e-14
        9.5974337876143e-15
        1.5319590844778e-15
        2.4832608913625e-16
        4.1033774245248e-17
        7.5234395267372e-18
        1.7945820514739e-18
        8.9729102573693e-19
        -5.5217970489512e-19
        -6.9022423323185e-19
        2.7608905667344e-19
        1.5184929948004e-18
        1.3804484664637e-19
        -1.5184929948004e-18
        -4.141351765584e-19
        2.0706679250508e-18
        1.3804484664637e-19
        2.4848046931575e-18
        -1.3804484664637e-19
    );

// ************************************************************************* //
